Revit 2026 API

# RoutingPreferenceRuleRemoveCriteron Method

---

Removes an existing criterion.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveCriteron(
	int index
)
```
```vb
Public Sub RemoveCriteron (
	index As Integer
)
```
```cpp
public:
void RemoveCriteron(
	int index
)
```
```fsharp
member RemoveCriteron :
        index : int -> unit
```

#### Parameters

index Int32
     The index position of removed routing preference rule in the group.

| Exception | Condition |
| --- | --- |
| ArgumentException | index is not a valid zero-based index. -or- Thrown if the index is out of bounds. |

#### Reference

RoutingPreferenceRule Class

Autodesk.Revit.DB Namespace